{"markdown":"# Financial Markets Customer Life Event Prediction\n\n### Introduction\n\nThe Customer Life Event Prediction accelerator includes a structured glossary of  business terms and a set of sample data science assets. The glossary provides the information architecture that you need to predict major life events, such as buying a home or relocating. You can use the sample notebooks, predictive models, and dashboards to accelerate data preparation, machine learning modelling, and data reporting. Set your clients on the path to financial success by engaging with them at the right time with relevant investment options.\n\n**Tip:** Download the PDF of these instructions from the  assets section on the **Assets** page so you can keep these instructions open while you work.\n\n- [Instructions](#instructions)\n- [Sample data assets](#data-assets)\n- [Notebooks](#notebooks)\n- [R Shiny dashboard](#dashboard)\n- [Sample business glossary](#glossary)\n\n<a id=\"instructions\"></a>\n## Instructions\n\nFollow these steps to implement the industry accelerator:\n1. Create a deployment space, which you'll need when you run the notebooks. From the navigation menu, select **Deployments &gt; New deployment space** and then complete these steps:\n    1. Enter the name `Customer Life Event Space`\n    1. Select your Watson Machine Learning service. If you don't have one, click the **Create** button and provision one.\n    1. Click on **Create** to create the deployment space.\n1. Navigate back to the accelerator project, select the **Assets** tab and scroll to the **Source Code** section.\n1. Edit the **1-data-preprocessing** notebook by clicking the vertical ellipsis next to the notebook name and choose **Edit** option. This notebook loads the data, creates and saves the `life_event_prep.py` script to prepare and clean data for model training. It also selects life events to predict from the data set. Follow the instructions in the notebook to configure and step through running it.\n1. Edit and run the **2-model-training** notebook. This notebook transforms the data, builds ML models  and deploys the models.\n1. Edit and run the **3-model-scoring**. This notebook deploys the data assets and a model scoring function.\n1. Run the dashboard from RStudio console by completing these steps:\n    1. Download the `customer-life-event-prediction-analytics-dashboard.zip` file from the project's Data section of the **Assets** page. \n    1. Click **Launch IDE &gt; RStudio** on the menu bar.\n    1. In the **Files** pane, select the **Upload** toolbar button and upload the `customer-life-event-prediction-analytics-dashboard.zip` file into RStudio.\n    1. Navigate to `customer-life-event-prediction-analytics-dashboard`, select the `app.R` file, and click the **Run App** toolbar button to launch the dashboard. If you see a warning message that certain packages are not installed, you can ignore it because the packages will be installed first time you run the app.\n    1. Once the app has launched, you can perform model scoring in real time by entering your API key and selecting your region on the **Client View** tab. \n1. Optional step: edit and run the `import-wkc-glossary` notebook. This notebook imports the glossary of business terms into Watson Knowledge Catalog, to get started on data governance, and then maps the business terms to the data headers. You must have the <a href=\"https://dataplatform.cloud.ibm.com/docs/content/wsj/catalog/roles-wkcop.html\" rel=\"noopener noreferrer\">permission to create governance artifacts</a>. Alternatively, import the glossary of business terms using the steps below:\n    1. Download the `customer-life-event-prediction-glossary-categories.csv`and `customer-life-event-prediction-glossary-terms.csv` files from the Data assets section of the **Assets** page.\n    1. Navigate to **Governance &gt; Categories**.\n    1. Click **Add Category &gt; Import From File**. \n    1. Import the `customer-life-event-prediction-glossary-categories.csv` file. Select **Replace all values** as your merge option.\n    1. Navigate to **Governance &gt; Business Terms**.\n    1. Click **Add Business Term &gt; Import From File**. \n    1. Import the `customer-life-event-prediction-glossary-terms.csv` file. Select **Replace all values** as your merge option.\n    1. Once the Import completes successfully, click on **Go to task** and then click **Publish** in the next page.\n    1. Navigate to **Governance &gt; Categories &gt; Industry Accelerators** to explore the business terms.\n\n\n**Note:** Importing the accelerator and running the notebooks and dashboard consumes approximately 1.5 - 2 Watson Studio CUH and 3 - 3.5 Watson Machine Learning CUH.\nAdditionally, once you start the **RStudio** Environment, you will be prompted to choose the RStudio environment definition. Some of the dashboards require larger memory allocation so would need a higher plans. Use the M plan in case your dashboard fails to start up in the XS plan. \n- **RStudio XS - 2 vCPU and 8 GB RAM** - Offered as part of the Free Lite plan and consumes 1 capacity unit per hour.\n- **RStudio M - 8 vCPU and 32 GB RAM** - Offered as part of the Paid plan and consumes 4 capacity units per hour.\n- **RStudio L - 16 vCPU and 64 GB RAM** - Offered as part of the Paid plan and consumes 8 capacity units per hour.\n\n <a id=\"data-assets\"></a>\n## Sample data assets\nThese sample data files that act as dimensional and fact tables are included in the project on the **Assets** page:\n\n- `event.csv`: Event and type data, Temporal data, Life event category etc.\n- `customer.csv` : Customer Data, Demographic data.\n- `census_probabilities.csv` : Migration, birth, marriage and birth probabilities based on USA census. (This is an optional addition for the user to incorporate census data into the final dataset for modelling.)\n- `news.csv`: Contains News information. This information is only used to depict relevant news and life event type information in the analytics dashboard.\n- `event_type.csv`:It comprises of event type data, life event type data etc.\n- `training_user_inputs_and_prepped_column_names.json` : Used for standardizing the numeric variables for modelling by scaling the values. \n- `customer-life-event-prediction-map-terms.csv` : File containing the list of mappings between column headers and business terms. <br>\n\n<a id=\"notebooks\"></a>\n## Notebooks\nFollow the instructions in the first few cells of the notebook to configure the project token and API key. Then run the notebooks step-by-step. <br>\n - **1-data-preprocessing**: This notebook performs the following functions:\n    - Load data\n    - Create and save script `life_event_prep.py` to prepare and clean data for model training\n    - Select life events to predict.\n\n- **2-model-training**: This notebook performs the following functions:\n    - Build ML models\n    - Analyze and visualize the data\n    - Select best performing ML model and save to Cloud Pak for Data\n    - Select a Watson Machine Learning based deployment space, store the models in the space, and deploy the model.\n\n- **3-model-scoring**: This notebook performs the following functions:\n    - Get the deployment space and deployments\n    - Deploy the data assets\n    - Create and deploying a pipeline function for model scoring\n    - Predict Life Events.\n\n- **import-wkc-glossary**: This notebook performs the following functions: \n    - Import the categories into Watson Knowledge Catalog using `customer-life-event-prediction-glossary-categories.csv`\n    - Import the business terms and publish them into Watson Knowledge Catalog using `customer-life-event-prediction-glossary-terms.csv`\n    - Publish `event.csv`,`customer.csv` and `census_probabilities.csv` files into an existing catalog and map business terms to column headers.\n\n<a id=\"dashboard\"></a>\n## R Shiny dashboard\n\nThe R Shiny dashboard displays model insights, customer summaries and scores new data. The dashboard has the following tab:\n\n`Dashboard View` : Shows client activity, Top action Clients, Market Action, Recent Life events experienced by clients, and Revenue Opportunities.\n\n`Client View` : Targets individual Client information (personal and financial), Depicts the Top Business Metrics, Visualizes Event distribution, opportunities and Client life event history. It also provides option to run the Model Scoring, Predicts Life Events and Visualizes the influential factors and data fields.\n\n\n<a id=\"glossary\"></a>\n## Sample business glossary for use with Watson Knowledge Catalog\nOptionally, the glossary of business terms can be imported into Watson Knowledge Catalog, to get started on data governance.<br>\nThe `customer-life-event-prediction-glossary-categories.csv` file defines the main and sub categories for the business terms. <br>\nThe `customer-life-event-prediction-glossary-terms.csv` file defines the business terms, category of the business terms and their Related Terms/Part of Terms, if applicable. <br>\n**Note:** This optional step requires the [Watson Knowledge Catalog] (https://cloud.ibm.com/catalog/services/watson-knowledge-catalog) service instance. \n\n### Terms and Conditions\nThis project contains Sample Materials, provided under this <a href=\"https://github.com/IBM/Industry-Accelerators/blob/master/CPD%20SaaS/LICENSE\" rel=\"noopener noreferrer\">license</a>. <br>\nLicensed Materials - Property of IBM. <br>\n© Copyright IBM Corp. 2019, 2023. All Rights Reserved. <br>\nUS Government Users Restricted Rights - Use, duplication or disclosure restricted by GSA ADP Schedule Contract with IBM Corp.<br>\n\n\n"}